#include <iostream>
#include <string>
#include <array>
#include <vector>
using namespace std;

int main() {
/*
    문제

    가로, 세로의 크기가 각각 100인 정사각형 모양의 흰색 도화지가 있다
    이 도화지 위에 가로, 세로의 크기가 각각 10인 정사각형 모양의 검은색 색종이를 
    색종이의 변과 도화지의 변이 평행하도록 붙인다
    색종이가 붙은 검은 영역의 넓이는?
*/

    //입력

    // 첫째 줄에 색종이의 수(100이하)가 주어진다
    int num;
    cin>>num;

    // 가로, 세로의 크기가 각각 100인 정사각형 모양의 흰색 도화지
    int white[100][100];
    //가로, 세로의 크기가 각각 10인 정사각형 모양의 검은색 색종이
    int black[10][10];

    // 둘째 줄부터 한 줄에 하나씩 색종이를 붙인 위치(2개의 자연수)가 주어진다
    //  첫 번째 자연수는 색종이의 왼쪽 변과 도화지의 왼쪽 변 사이의 거리이고
    // 두 번째 자연수는 색종이의 아래쪽 변과 도화지의 아래쪽 변 사이의 거리이다
    for(int i=0;i<3;++i){

    }


    // 출력

    // 첫째 줄에 색종이가 붙은 검은 영역의 넓이를 출력한다.
    








    return 0;
}